src_doc/InformationRegisters/РеестрКонтролей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РеестрКонтролей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаКонтроле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПостановкиНаКонтроль</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнителиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятСКонтроля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтоКонтролируем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСортировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/РеестрКонтролей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные контроля в реестре конкретного пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  КонтрольСсылка - СправочникСсылка.Контроль
// 
// Возвращаемое значение:
//  - Неопределено
//  - Структура
// 
Функция ДанныеКонтроляВРеестре(Пользователь, КонтрольСсылка) Экспорт
	
	ДанныеКонтроляВРеестре = Неопределено;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеестрКонтролей.Пользователь КАК Пользователь,
		|	РеестрКонтролей.ДатаСортировки КАК ДатаСортировки,
		|	РеестрКонтролей.Основание КАК Основание,
		|	РеестрКонтролей.НаКонтроле КАК НаКонтроле,
		|	РеестрКонтролей.Просрочено КАК Просрочено,
		|	РеестрКонтролей.ДатаПостановкиНаКонтроль КАК ДатаПостановкиНаКонтроль,
		|	РеестрКонтролей.ИсполнителиСтрокой КАК ИсполнителиСтрокой,
		|	РеестрКонтролей.Контролер КАК Контролер,
		|	РеестрКонтролей.ЧтоКонтролируем КАК ЧтоКонтролируем,
		|	РеестрКонтролей.СнятСКонтроля КАК СнятСКонтроля,
		|	РеестрКонтролей.СрокИсполнения КАК СрокИсполнения
		|ИЗ
		|	РегистрСведений.РеестрКонтролей КАК РеестрКонтролей
		|ГДЕ
		|	РеестрКонтролей.Основание = &Основание
		|	И РеестрКонтролей.Пользователь = &Пользователь");
	
	Запрос.УстановитьПараметр("Основание", КонтрольСсылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДанныеКонтроляВРеестре;
	КонецЕсли;
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	СтрокаРезультата = ТаблицаРезультата[0];
	
	ДанныеКонтроляВРеестре = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаРезультата);
	
	Возврат ДанныеКонтроляВРеестре;
	
КонецФункции

#КонецОбласти

#КонецЕсли
